[{"appearance": "OOP German Conference- Spring with live coding # Cloud Native Java Abstract: Work takes time to flow through an organization and ultimately be deployed to production where it captures value. It’s critical to reduce time-to-production. Software - for many organizations and industries - is a competitive advantage. Organizations break their larger software ambitions into smaller, independently deployable, feature -centric batches of work - microservices. In order to reduce the round-trip between stations of work, organizations collapse or consolidate as much of them as possible and automate the rest; developers and operations beget “devops,” cloud-based services and platforms automate operations work and break down the need for ITIL tickets and change management boards. But velocity, for velocity’s sake, is dangerous. Microservices invite architectural complexity that few are prepared to address. In this talk, we’ll look at how high performance organizations like Ticketmaster, Alibaba, and Netflix make short work of that complexity with Spring Boot and Spring Cloud.", "start_date": "2/9/2021", "end_date": "2/9/2021", "time": "9:45am - 12:15pm PT", "marketing_blurb": "Join me for the epic OOP Java conference where I'll be talking about Cloud Native Java"}, {"appearance": "JavaDayLviv 2021", "start_date": "2/18/2021", "end_date": "2/18/2021", "time": "11:30pm PST", "marketing_blurb": "I'll be speaking at JavaDayLviv and I hope to see you there!"}, {"appearance": "Panelist Invite - How to prevent debugging from becoming a productivity & delivery killer other panel members: Daniel Bryant  (Ambassador Labs), Mary Grygleski (IBM), Jonathan Harris (Undo)", "start_date": "2/24/2021", "end_date": "2/24/2021", "time": "10:45am -11am sound check 11am -12pm panel", "marketing_blurb": "I'll be on a panel for Undo software along with others like Mary Grygleski, Jonathan Harris, Daniel Bryant and Angie Jones. Do Not Miss This! "}, {"appearance": "Code on Twitch", "start_date": "2/24/2021", "end_date": "2/24/2021", "time": "12-1pm PST", "marketing_blurb": "Join me on Tanzu TV - twitch.tv/vmwaretanzu - and we'll look at Spring Cloud Gateway"}, {"appearance": "Talk for Java User Group Passau- Reactive Spring - 45 minute talk and 15 Q&A", "start_date": "3/9/2021", "end_date": "3/9/2021", "time": "11am-12pm PDT", "marketing_blurb": "I'll be doing a talk for the Java User Group Passau on Reactive Spring"}]