[{"event": "JFokus 2022", "start_date": "2/6/2023", "end_date": "2/8/2023", "time": "", "marketing_blurb": "Hi, Spring fans! I am so excited to be returning to JFokus for 2023!"}, {"event": "devnexus 2023", "start_date": "4/4/2023", "end_date": "4/6/2023", "time": "", "marketing_blurb": "Hi, Spring fans! I am so excited to return to Devnexus 2023, to talk about Spring Boot 3"}, {"event": "Great Indian Developer Summit ", "start_date": "4/26/2023", "end_date": "4/28/2023", "time": "", "marketing_blurb": "I'm so pleased to be appearing, for the first time since before the pandemic, at the Great International Developer Summit in beautiful Bangalore, India!"}, {"event": "Devoxx GR", "start_date": "5/3/2023", "end_date": "5/6/2023", "time": "", "marketing_blurb": "I'm so excited to be at the brand new Devoxx Greece event, speaking about Spring Boot 3! "}, {"event": "Devoxx UK", "start_date": "5/10/2023", "end_date": "5/12/2023", "time": "", "marketing_blurb": "hey, Devoxx UK, I'm back! This time I'll be talking about Spring Boot 3 in one talk and doing a special deep dive on Spring Boot's new GraalVM native image support with Oracle GraalVM developer advocate Alina Yurenko! Don't miss it!"}, {"event": "Spring IO", "start_date": "5/18/2023", "end_date": "5/19/2023", "time": "", "marketing_blurb": "Hola a todo el mundo! I'll be returning to Spring I/O, the unofficial SpringOne Europe, and I hope you'll join us there! There's a ton to see. I'll be looking at Spring Boot 3, of course, but I'll also be looking forward at what's to come, too. Do NOT miss this!"}, {"event": "ITKonekt 2023", "start_date": "5/20/2023", "end_date": "5/21/2023", "time": "", "marketing_blurb": "I'm so looking forward to returning to ITKonekt in Belgrade for the first time since before the pandemic! "}, {"event": "Taiwan JUG", "start_date": "6/16/2023", "end_date": "6/16/2023", "time": "", "marketing_blurb": "I'll be speaking at the Taipei edition of the Taiwan JUG! Let's talk about Spring Boot 3.x and chou dofu together! https://webcommwebinar.kktix.cc/events/0616"}, {"event": "Presentation on Spring Boot 3.x at the Microsoft Reactor in Sydney, Australia", "start_date": "7/20/2023", "end_date": "7/20/2023", "time": "17:00-19:00", "marketing_blurb": "Hi Sydney! I'll be speaking at the Microsoft Reactor on 20 June 2023 at 17:00! Register now https://connect.tanzu.vmware.com/Bootiful_Spring_Boot_3x_au.html"}, {"event": "Devoxx BE 2023", "start_date": "10/2/2023", "end_date": "10/6/2023", "time": "", "marketing_blurb": "I hope to see you at this year's fabulous Devoxx show in Antwerp, Belgium!"}, {"event": "Josh and James ward Boulder or Denver JUG", "start_date": "10/11/2023", "end_date": "10/11/2023", "time": "", "marketing_blurb": "I'll be joining my friend and hero James Ward for this Boulder/Denver JUG appearance introducing the wide and wonderful opportunities for Spring Boot developers and Kotlin users"}, {"event": "Utah JUG", "start_date": "10/19/2023", "end_date": "10/19/2023", "time": "", "marketing_blurb": "I'll be in Salt Lake City, UT, bringing the Spring at the local JUG, and I can't wait to see you there, too."}]