[
 
  	{
		"title" :"Reactive Spring Boot Livelessons (2nd Edition)",
		"html" : "<P>Want to learn about how to build reactive systems and services with Spring Boot? Then you're in luck! These are just the lessons for you!</P> ",
		"imageUrl" : "https://api.joshlong.com/media/livelessons/ReactiveSpringLL-2E.jpg" 
	} ,
	{ 
		"title" : "Spring Security Livelessons" , 
		"html": "<P> Spring Security has been around almost as long as Spring itself. In the early days, it was called the Acegi framework. It has come quite the distance since then! Spring Security features the most robust ecosystem for security integrations for enterprise Java developers (or, indeed, all developers!) and you should definitely get to know it. Join Spring Security project lead Rob Winch and yours truly and we'll look at how to build secure Spring Boot applications and services. </p> " ,
		"imageUrl" : "https://api.joshlong.com/media/livelessons/SpringSecurityLL.jpg" 
	
	} ,

 	{
		"title" :"Spring Boot and Kotlin Livelessons",
		"html" : "<P>  Kotlin is the new JVM language sensation that's sweeping nations. It's elegant, concise, easy-to-learn and - most importantly: very, very, very pragmatic. This pragmatism was born of deep collaborations with various communities (like server-side JVM-based workloads and mobile Android-based workloads) and their use cases. Join me, Spring Developer Advocate Josh Long and we'll look at why Spring Boot and Kotlin were made for each other!  </P>",
		"imageUrl" : "https://api.joshlong.com/media/livelessons/spring-boot-and-kotlin.jpg" 
	} ,


	{
		"title" :"Building Microservices with Spring Boot Livelessons ",
		"html" : "<P>     This should be your first stop if you haven't used Spring Boot before! This video, featuring Spring Boot lead and project cofounder Phil Webb and yours truly presents an exhaustive look at the framework and its various, supported use cases.   </P>  ",
		"imageUrl" : "http://api.joshlong.com/media/livelessons/BuildMicroserviceswSpringBoot_2eLL.jpg" 
	} ,

       {
		"title" :"Cloud Foundry Livelessons",
		"html" : "<P>  CloudFoundry is the leading on-prem Platform-as-a-Service. It's been designed from the ground up to allow organiztions to deliver value - software, systems, and services - into production with ease. As a Spring Developer, it's a natural fit and this is your must-watch introduction to going to production with Cloud Foundry.</P>  ",
		"imageUrl" : "http://api.joshlong.com/media/livelessons/CloudNativeJavaLL.jpg" 
	}   ,
	
	{
		"title" :"Cloud Native Java Livelessons (with Kubernetes)",
		"html" : "<P>  Spring Boot is the most efficient and productive way to get to production and these days, as often as not, production <EM>is</em> Kubernetes. Join me, and we'll look at how to applications that survive and thrive in the cloud, an on Kubernetes, in particular </P>  ",
		"imageUrl" : "http://api.joshlong.com/media/livelessons/CloudNativeJavaLL.jpg" 
	}  

]
